Revit 2027 API
FabricationConfiguration.GetAncillaryGroup Method
 Gets the fabrication ancillary group of the specified fabrication ancillary identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetAncillaryGroup(
	int ancillaryId
)
Public Function GetAncillaryGroup (
	ancillaryId As Integer
) As String
public:
String^ GetAncillaryGroup(
	int ancillaryId
)
member GetAncillaryGroup :
        ancillaryId : int -> string
Parameters
ancillaryId Int32
 The fabrication ancillary database identifier of the ancillary.
Return Value
String
 The group name of the ancillary.
Exceptions
Exception | Condition
ArgumentException |  The ancillary does not exist.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace